
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИдентификаторыМетаданных() Экспорт 
	
	Идентификаторы = Новый Соответствие;
	Идентификаторы.Вставить("37f2fa9a-b276-11d4-9435-004095e12fc7", "Subsystems");
	Идентификаторы.Вставить("0fe48980-252d-11d6-a3c7-0050bae0a776", "CommonModules");
	Идентификаторы.Вставить("24c43748-c938-45d0-8d14-01424a72b11e", "SessionParameters");
	Идентификаторы.Вставить("09736b02-9cac-4e3f-b4f7-d3e9576ab948", "Roles");
	Идентификаторы.Вставить("15794563-ccec-41f6-a83c-ec5f7b9a5bc1", "CommonAttributes");
	Идентификаторы.Вставить("857c4a91-e5f4-4fac-86ec-787626f1c108", "ExchangePlans");
	Идентификаторы.Вставить("3e7bfcc0-067d-11d6-a3c7-0050bae0a776", "FilterCriteria");
	Идентификаторы.Вставить("4e828da6-0f44-4b5b-b1c0-a2b3cfe7bdcc", "EventSubscriptions");
	Идентификаторы.Вставить("11bdaf85-d5ad-4d91-bb24-aa0eee139052", "ScheduledJobs");
	Идентификаторы.Вставить("af547940-3268-434f-a3e7-e47d6d2638c3", "FunctionalOptions");
	Идентификаторы.Вставить("30d554db-541e-4f62-8970-a1c6dcfeb2bc", "FunctionalOptionsParameters");
	Идентификаторы.Вставить("c045099e-13b9-4fb6-9d50-fca00202971e", "DefinedTypes");
	Идентификаторы.Вставить("46b4cd97-fd13-4eaa-aba2-3bddd7699218", "SettingsStorages");
	Идентификаторы.Вставить("07ee8426-87f1-11d5-b99c-0050bae0a95d", "CommonForms");
	Идентификаторы.Вставить("2f1a5187-fb0e-4b05-9489-dc5dd6412348", "CommonCommands");
	Идентификаторы.Вставить("1c57eabe-7349-44b3-b1de-ebfeab67b47d", "CommandGroups");
	Идентификаторы.Вставить("39bddf6a-0c3c-452b-921c-d99cfa1c2f1b", "Interfaces");
	Идентификаторы.Вставить("0c89c792-16c3-11d5-b96b-0050bae0a95d", "CommonTemplates");
	Идентификаторы.Вставить("7dcd43d9-aca5-4926-b549-1842e6a4e8cf", "CommonPictures");
	Идентификаторы.Вставить("cc9df798-7c94-4616-97d2-7aa0b7bc515e", "XDTOPackages");
	Идентификаторы.Вставить("8657032e-7740-4e1d-a3ba-5dd6e8afb78f", "WebServices");
	Идентификаторы.Вставить("d26096fb-7a5d-4df9-af63-47d04771fa9b", "WSLinks");
	Идентификаторы.Вставить("58848766-36ea-4076-8800-e91eb49590d7", "StyleItems");
	Идентификаторы.Вставить("3e5404af-6ef8-4c73-ad11-91bd2dfac4c8", "Styles");
	Идентификаторы.Вставить("58848766-36ea-4076-8800-e91eb49590d7", "Styles.StyleItems");
	Идентификаторы.Вставить("9cd510ce-abfc-11d4-9434-004095e12fc7", "Languages");
	Идентификаторы.Вставить("0195e80c-b157-11d4-9435-004095e12fc7", "Constants");
	Идентификаторы.Вставить("cf4abea6-37b2-11d4-940f-008048da11f9", "Catalogs");
	Идентификаторы.Вставить("061d872a-5787-460e-95ac-ed74ea3a3e84", "Documents");
	Идентификаторы.Вставить("36a8e346-9aaa-4af9-bdbd-83be3c177977", "DocumentNumerators");
	Идентификаторы.Вставить("bc587f20-35d9-11d6-a3c7-0050bae0a776", "Sequences");
	Идентификаторы.Вставить("4612bd75-71b7-4a5c-8cc5-2b0b65f9fa0d", "DocumentJournals");
	Идентификаторы.Вставить("f6a80749-5ad7-400b-8519-39dc5dff2542", "Enums");
	Идентификаторы.Вставить("631b75a0-29e2-11d6-a3c7-0050bae0a776", "Reports");
	Идентификаторы.Вставить("bf845118-327b-4682-b5c6-285d2a0eb296", "DataProcessors");
	Идентификаторы.Вставить("82a1b659-b220-4d94-a9bd-14d757b95a48", "ChartsOfCharacteristicTypes");
	Идентификаторы.Вставить("238e7e88-3c5f-48b2-8a3b-81ebbecb20ed", "ChartsOfAccounts");
	Идентификаторы.Вставить("30b100d6-b29f-47ac-aec7-cb8ca8a54767", "ChartsOfCalculationTypes");
	Идентификаторы.Вставить("13134201-f60b-11d5-a3c7-0050bae0a776", "InformationRegisters");
	Идентификаторы.Вставить("b64d9a40-1642-11d6-a3c7-0050bae0a776", "AccumulationRegisters");
	Идентификаторы.Вставить("2deed9b8-0056-4ffe-a473-c20a6c32a0bc", "AccountingRegisters");
	Идентификаторы.Вставить("f2de87a8-64e5-45eb-a22d-b3aedab050e7", "CalculationRegisters");
	Идентификаторы.Вставить("fcd3404e-1523-48ce-9bc0-ecdb822684a1", "BusinessProcesses");
	Идентификаторы.Вставить("3e63355c-1378-4953-be9b-1deb5fb6bec5", "Tasks");
	Идентификаторы.Вставить("5274d9fc-9c3a-4a71-8f5e-a0db8ab23de5", "ExternalDataSources");
	
	Возврат Новый ФиксированноеСоответствие(Идентификаторы);
	
КонецФункции

Функция СтруктураМетаданных() Экспорт 
	
	МетаСтруктура = Новый Соответствие;
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ConfigName", "", 0,
		"Конфигурация", "", НСтр("ru='Конфигурация'"), 0); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ConfigAttributtes", "ConfigName", 1,
		"КонфигурацияСвойства", "Свойства", НСтр("ru='Свойства'"), -1); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ConfigCommon", "ConfigName", 2,
		"Общие", "Общие", НСтр("ru='Общие'"), 1); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Subsystems", "ConfigCommon", 1,
		"Подсистема", "Общие.Подсистемы", НСтр("ru='Подсистемы'"), 2); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonModules", "ConfigCommon", 2,
		"ОбщийМодуль", "Общие.ОбщиеМодули", НСтр("ru='Общие модули'"), 3); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "SessionParameters", "ConfigCommon", 3,
		"ПараметрСеанса", "Общие.ПараметрыСеанса", НСтр("ru='Параметры сеанса'"), 4); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Roles", "ConfigCommon", 4,
		"Роль", "Общие.Роли", НСтр("ru='Роли'"), 5); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonAttributes", "ConfigCommon", 5,
		"ОбщийРеквизит", "Общие.ОбщиеРеквизиты", НСтр("ru='Общие реквизиты'"), 6,,,,, Ложь); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ExchangePlans", "ConfigCommon", 6,
		"ПланОбмена", "Общие.ПланыОбмена", НСтр("ru='Планы обмена'"), 7,,
		"87c509ab-3d38-4d67-b379-aca796298578", "d5207c64-11d5-4d46-bba2-55b7b07ff4eb",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"1a1b4fea-e093-470d-94ff-1d2f16cda2ab"); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "FilterCriteria", "ConfigCommon", 7,
		"КритерийОтбора", "Общие.КритерииОтбора", НСтр("ru='Критерии отбора'"), 8,,
		"00867c40-06b1-11d6-a3c7-0050bae0a776", "23fa3b84-220a-40e9-8331-e588bed87f7d"); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "EventSubscriptions", "ConfigCommon", 8,
		"ПодпискаНаСобытие", "Общие.ПодпискиНаСобытия", НСтр("ru='Подписки на событие'"), 9); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ScheduledJobs", "ConfigCommon", 9,
		"РегламентноеЗадание", "Общие.РегламентныеЗадания", НСтр("ru='Регламентные задания'"), 10); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "FunctionalOptions", "ConfigCommon", 10,
		"ФункциональнаяОпция", "Общие.ФункциональныеОпции", НСтр("ru='Функциональные опции'"), 11); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "FunctionalOptionsParameters", "ConfigCommon", 11,
		"ПараметрФункциональнойОпции", "Общие.ПараметрыФункциональныхОпций", НСтр("ru='Параметры функциональных опций'"), 12); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "DefinedTypes", "ConfigCommon", 12,
		"ОпределяемыйТип", "Общие.ОпределяемыеТипы", НСтр("ru='ОпределяемыеТипы'"), 13,,,,, Ложь); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "SettingsStorages", "ConfigCommon", 13,
		"ХранилищеНастроек", "Общие.ХранилищаНастроек", НСтр("ru='Хранилища настроек'"), 14,,
		"b8533c0c-2342-4db3-91a2-c2b08cbf6b23"); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonForms", "ConfigCommon", 14,
		"ОбщаяФорма", "Общие.ОбщиеФормы", НСтр("ru='Общие формы'"), 15); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonCommands", "ConfigCommon", 15,
		"ОбщаяКоманда", "Общие.ОбщиеКоманды", НСтр("ru='Общие команды'"), 16); 
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommandGroups", "ConfigCommon", 16,
		"ГруппаКоманд", "Общие.ГруппыКоманд", НСтр("ru='Группы команд'"), 17);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Interfaces", "ConfigCommon", 17,
		"Интерфейс", "Общие.Интерфейсы", НСтр("ru='Интерфейсы'"), 18,,,,,, Ложь);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonTemplates", "ConfigCommon", 18,
		"ОбщийМакет", "Общие.ОбщиеМакеты", НСтр("ru='Общие макеты'"), 19);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CommonPictures", "ConfigCommon", 19,
		"ОбщаяКартинка", "Общие.ОбщиеКартинки", НСтр("ru='Общие картинки'"), 20);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "XDTOPackages", "ConfigCommon", 20,
		"XDTOПакет", "Общие.XDTOПакеты", НСтр("ru='XDTO-пакеты'"), 21);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "WebServices", "ConfigCommon", 21,
		"WebСервис", "Общие.WebСервисы", НСтр("ru='Web-сервисы'"), 22);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "WSLinks", "ConfigCommon",	22,
		"WSСсылка", "Общие.WSСсылки", НСтр("ru='WS-ссылки'"), 23);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "StyleItems", "ConfigCommon", 23,
		"ЭлементСтиля", "Общие.ЭлементыСтиля", НСтр("ru='Элементы стиля'"), 24,,,,, Ложь);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Styles", "ConfigCommon", 24,
		"Стиль", "Общие.Стили", НСтр("ru='Стили'"), 25);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Styles.StyleItems", "Styles", 1,
		"ЭлементСтиля", "Общие.Стили.ЭлементыСтиля", НСтр("ru='Элементы стиля'"), 26,,,,,, Ложь);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Languages", "ConfigCommon", 25,
		"Язык", "Общие.Языки", НСтр("ru='Языки'"), 27);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Constants", "ConfigName", 3,
		"Константа", "Константы", НСтр("ru='Константы'"), 28);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Catalogs", "ConfigName", 4,
		"Справочник", "Справочники", НСтр("ru='Справочники'"), 29,,
		"fdf816d2-1ead-11d5-b975-0050bae0a95d", "4fe87c89-9ad4-43f6-9fdb-9dc83b3879c6",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"cf4abea7-37b2-11d4-940f-008048da11f9", "932159f9-95b2-4e76-a8dd-8849fe5c5ded",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Documents", "ConfigName", 5,
		"Документ", "Документы", НСтр("ru='Документы'"), 32,,
		"fb880e93-47d7-4127-9357-a20e69c17545", "b544fc6a-2ba3-4885-8fb2-cb289fb6d65e",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"45e46cbc-3e24-4165-8b7b-cc98a6f80211", "21c53e09-8950-4b5e-a6a0-1054f1bbc274",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "DocumentNumerators", "Documents", 1,
		"Нумератор", "Документы.НумераторыДокументов", НСтр("ru='Нумераторы'"), 30);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Sequences", "Documents", 2,
		"Последовательность", "Документы.Последовательности", НСтр("ru='Последовательности'"), 31);
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "DocumentJournals", "ConfigName", 6,
		"ЖурналДокументов", "ЖурналыДокументов", НСтр("ru='Журналы документов'"), 33,,
		"ec81ad10-ca07-11d5-b9a5-0050bae0a95d", "a49a35ce-120a-4c80-8eea-b0618479cd70",
		"3daea016-69b7-4ed4-9453-127911372fe6");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Enums", "ConfigName", 7,
		"Перечисление", "Перечисления", НСтр("ru='Перечисления'"), 34,,
		"33f2e54b-37ce-4a7a-a569-b648d7aa4634", "6d8d73a7-ba29-401d-9032-3872ec2d6433",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,,,,
		"bee0a08c-07eb-40c0-8544-5c364c171465");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Reports", "ConfigName", 8,
		"Отчет", "Отчеты", НСтр("ru='Отчеты'"), 35,,
		"a3b368c0-29e2-11d6-a3c7-0050bae0a776", "e7ff38c0-ec3c-47a0-ae90-20c73ca72246",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"7e7123e0-29e2-11d6-a3c7-0050bae0a776", "b077d780-29e2-11d6-a3c7-0050bae0a776",
		"c339c860-29e2-11d6-a3c7-0050bae0a776");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "DataProcessors", "ConfigName", 9,
		"Обработка", "Обработки", НСтр("ru='Обработки'"), 36,,
		"d5b0e5ed-256d-401c-9c36-f630cafd8a62", "45556acb-826a-4f73-898a-6025fc9536e1",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"ec6bb5e5-b7a8-4d75-bec9-658107a699cf", "2bcef0d1-0981-11d6-b9b8-0050bae0a95d",
		"5d24a9d1-098e-11d6-b9b8-0050bae0a95d");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ChartsOfCharacteristicTypes", "ConfigName", 10,
		"ПланВидовХарактеристик", "ПланыВидовХарактеристик", НСтр("ru='Планы видов характеристик'"), 37,,
		"eb2b78a8-40a6-4b7e-b1b3-6ca9966cbc94", "95b5e1d4-abfa-4a16-818d-a5b07b7d3f73",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"31182525-9346-4595-81f8-6f91a72ebe06", "54e36536-7863-42fd-bea3-c5edd3122fdc",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ChartsOfAccounts", "ConfigName", 11,
		"ПланСчетов", "ПланыСчетов", НСтр("ru='Планы счетов'"), 38,,
		"5372e285-03db-4f8c-8565-fe56f1aea40e", "0df30176-6865-4787-9fc8-609eb144174f",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"6e65cbf5-daa8-4d8d-bef8-59723f4e5777", "4c7fec95-d1bd-4508-8a01-f1db090d9af8",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ChartsOfCalculationTypes", "ConfigName", 12,
		"ПланВидовРасчета", "ПланыВидовРасчета", НСтр("ru='Планы видов расчета'"), 39,,
		"a7f8f92a-7a4b-484b-937e-42d242e64144", "2e90c75b-2f0c-4899-a7d4-5426eaefc96e",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"0dc22ad2-476a-4794-afae-cfa7ed251752", "054aa8cf-faa6-4634-aef4-1087ca0d88fc",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "InformationRegisters", "ConfigName", 13,
		"РегистрСведений", "РегистрыСведений", НСтр("ru='Регистры сведений'"), 40,,
		"13134204-f60b-11d5-a3c7-0050bae0a776", "b44ba719-945c-445c-8aab-1088fa4df16e",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"a2207540-1400-11d6-a3c7-0050bae0a776",,,,
		"13134203-f60b-11d5-a3c7-0050bae0a776", "13134202-f60b-11d5-a3c7-0050bae0a776");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "AccumulationRegisters", "ConfigName", 14,
		"РегистрНакопления", "РегистрыНакопления", НСтр("ru='Регистры накопления'"), 41,,
		"b64d9a44-1642-11d6-a3c7-0050bae0a776", "99f328af-a77f-4572-a2d8-80ed20c81890",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"b64d9a42-1642-11d6-a3c7-0050bae0a776",,,,
		"b64d9a43-1642-11d6-a3c7-0050bae0a776", "b64d9a41-1642-11d6-a3c7-0050bae0a776");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "AccountingRegisters", "ConfigName", 15,
		"РегистрБухгалтерии", "РегистрыБухгалтерии", НСтр("ru='Регистры бухгалтерии'"), 42,,
		"d3b5d6eb-4ea2-4610-a3e2-624d4e815934", "7162da60-f7fe-4d78-ad5d-e31700f9af18",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"9d28ee33-9c7e-4a1b-8f13-50aa9b36607b",,,,
		"35b63b9d-0adf-4625-a047-10ae874c19a3", "63405499-7491-4ce3-ac72-43433cbe4112");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "CalculationRegisters", "ConfigName", 16,
		"РегистрРасчета", "РегистрыРасчета", НСтр("ru='Регистры расчета'"), 43, "274bf899-db0e-4df6-8ab5-67bf6371ec0b",
		"a2cb086c-db98-43e4-a1a9-0760ab048f8d", "acdf0f11-2d59-4e37-9945-c6721871a8fe",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"1b304502-2216-440b-960f-60decd04bb5d",,,,
		"b12fc850-8210-43c8-ae05-89567e698fbb", "702b33ad-843e-41aa-8064-112cd38cc92c");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "BusinessProcesses", "ConfigName", 17,
		"БизнесПроцесс", "БизнесПроцессы", НСтр("ru='Бизнес-процессы'"), 44,,
		"3f7a8120-b71a-4265-98bf-4d9bc09b7719", "7a3e533c-f232-40d5-a932-6a311d2480bf",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"87c988de-ecbf-413b-87b0-b9516df05e28", "a3fe6537-d787-40f7-8a06-419d2f0c1cfd",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "Tasks", "ConfigName", 18,
		"Задача", "Задачи", НСтр("ru='Задачи'"), 45,,
		"3f58cbfb-4172-4e54-be49-561a579bb38b", "f27c2152-a2c9-4c30-adb1-130f5eb2590f",
		"3daea016-69b7-4ed4-9453-127911372fe6",,,
		"8ddfb495-c5fc-46b9-bdc5-bcf58341bff0", "ee865d4b-a458-48a0-b38f-5a26898feeb0",
		"888744e1-b616-11d4-9436-004095e12fc7");
	
	ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, "ExternalDataSources", "ConfigName", 19,
		"ВнешнийИсточникДанных", "ВнешниеИсточникиДанных", НСтр("ru='Внешние источники данных'"), 46);
	
	Возврат Новый ФиксированноеСоответствие(МетаСтруктура);
	
КонецФункции

Функция РасширенияОбъектов() Экспорт 
	
	Расширения = Новый Соответствие;
	
	#Область ConfigAttributtes
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".0", "МодульСеансаПользователя", НСтр("ru='Модуль сеанса'"), "МОД", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".1", "Логотип", НСтр("ru='Логотип'"), "К", 8);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".2", "Заставка", НСтр("ru='Заставка'"), "К", 9);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".3", "Справка", НСтр("ru='Справка'"), "СПР", 7);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".4", "Поддержка", НСтр("ru='Возможность изменения объектов, находящихся на поддержке'"), "ПП", 10);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".5", "МодульВнешнегоСоединения", НСтр("ru='Модуль внешнего соединения'"), "МОД", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".6", "МодульУправляемогоПриложения", НСтр("ru='Модуль управляемого приложения'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".7", "МодульПриложения", НСтр("ru='Модуль приложения'"), "МОД", 2);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".8", "РабочаяОбластьРС", НСтр("ru='Рабочая область рабочего стола'"), "РО", 6);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".9", "ПоддержкаПодсистем", НСтр("ru='Объекты подсистем на поддержке'"), "ПП", 11);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ConfigAttributtes",
		".a", "КомандныйИнтерфейсКонфигурации", НСтр("ru='Командный интерфейс конфигурации'"), "КИ", 5);
	#КонецОбласти 
	
	#Область Roles_ScheduledJobs_Interfaces_XDTOPackages_Styles_SettingsStorages
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Roles",
		".0", "Права", НСтр("ru='Права'"), "Р", 0);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ScheduledJobs",
		".0", "Расписание", НСтр("ru='Расписание'"), "РС", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Interfaces",
		".0", "Интерфейс", НСтр("ru='Интерфейс'"), "", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "XDTOPackages",
		".0", "ТекстПакета", НСтр("ru='Текст пакета'"), "ТХТ", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Styles",
		".0", "СоставСтиля", НСтр("ru='Состав стиля'"), "", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "SettingsStorages",
		".8", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", );
	#КонецОбласти 
	
	#Область CommonPictures_CommonTemplates_CommonCommands
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CommonPictures",
		".0", "Картинка", НСтр("ru='Картинка'"), "К", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CommonTemplates",
		".0", "Макет", НСтр("ru='Макет'"), "М", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CommonCommands",
		".2", "МодульКоманды", НСтр("ru='Модуль команды'"), "МОД", );
	#КонецОбласти 
	
	#Область ExchangePlans
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ExchangePlans",
		".0", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ExchangePlans",
		".1", "Состав", НСтр("ru='Состав'"), "", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ExchangePlans",
		".2", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ExchangePlans",
		".3", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область CommonForms
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CommonForms",
		".0", "МодульФормы", НСтр("ru='Модуль формы'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CommonForms",
		".1", "Справка", НСтр("ru='Справка'"), "С", 2);
	#КонецОбласти 
	
	#Область Catalogs
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Catalogs",
		".0", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Catalogs",
		".1", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Catalogs",
		".1c", "Предопределенные", НСтр("ru='Предопределенные'"), "П", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Catalogs",
		".3", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область ChartsOfCharacteristicTypes
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCharacteristicTypes",
		".5", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCharacteristicTypes",
		".7", "Предопределенные", НСтр("ru='Предопределенные'"), "П", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCharacteristicTypes",
		".15", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCharacteristicTypes",
		".16", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область ChartsOfCalculationTypes
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCalculationTypes",
		".0", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCalculationTypes",
		".1", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCalculationTypes",
		".2", "Предопределенные", НСтр("ru='Предопределенные'"), "П", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfCalculationTypes",
		".3", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область ChartsOfAccounts
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfAccounts",
		".5", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfAccounts",
		".9", "Предопределенные", НСтр("ru='Предопределенные'"), "П", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfAccounts",
		".14", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "ChartsOfAccounts",
		".15", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область Form_Template_Command
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Form",
		".0", "МодульФормы", НСтр("ru='Модуль формы'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Form",
		".1", "Справка", НСтр("ru='Справка'"), "С", 2);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Template",
		".0", "Макет", НСтр("ru='Макет'"), "М", );
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Command",
		".2", "МодульКоманды", НСтр("ru='Модуль команды'"), "МОД", );
	#КонецОбласти 
	
	#Область Subsystems
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Subsystems",
		".0", "Справка", НСтр("ru='Справка'"), "С", 2);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Subsystems",
		".1", "КомандныйИнтерфейс", НСтр("ru='Командный интерфейс'"), "КИ", 1);
	#КонецОбласти 
	
	#Область Tasks
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Tasks",
		".5", "Справка", НСтр("ru='Справка'"), "С", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Tasks",
		".6", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "Tasks",
		".7", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область BusinessProcesses
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "BusinessProcesses",
		".5", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "BusinessProcesses",
		".6", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "BusinessProcesses",
		".7", "КартаМаршрута", НСтр("ru='Карта маршрута'"), "КМ", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "BusinessProcesses",
		".8", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область InformationRegisters
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "InformationRegisters",
		".0", "Справка", НСтр("ru='Справка'"), "С", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "InformationRegisters",
		".1", "МодульНабораЗаписей", НСтр("ru='Модуль набора записей'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "InformationRegisters",
		".2", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область AccumulationRegisters
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccumulationRegisters",
		".0", "Справка", НСтр("ru='Справка'"), "С", 4);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccumulationRegisters",
		".1", "МодульНабораЗаписей", НСтр("ru='Модуль набора записей'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccumulationRegisters",
		".2", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccumulationRegisters",
		".3", "Агрегат", НСтр("ru='Агрегат'"), "АГР", 3);
	#КонецОбласти 
	
	#Область AccountingRegisters
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccountingRegisters",
		".5", "Справка", НСтр("ru='Справка'"), "С", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccountingRegisters",
		".6", "МодульНабораЗаписей", НСтр("ru='Модуль набора записей'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "AccountingRegisters",
		".7", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область CalculationRegisters
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CalculationRegisters",
		".0", "Справка", НСтр("ru='Справка'"), "С", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CalculationRegisters",
		".1", "МодульНабораЗаписей", НСтр("ru='Модуль набора записей'"), "МОД", 1);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "CalculationRegisters",
		".2", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область DocumentJournals
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "DocumentJournals",
		".0", "Справка", НСтр("ru='Справка'"), "С", 3);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "DocumentJournals",
		".1", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	
	ДобавитьЗаписьРасширенияОбъекта(Расширения, "DocumentJournals",
		".2", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	#КонецОбласти 
	
	#Область ОстальныеОбъекты
	МассивВладельцев = СтрРазделить("*", ",", Ложь);
	Для Каждого Наименование Из МассивВладельцев Цикл
		ДобавитьЗаписьРасширенияОбъекта(Расширения, Наименование,
			".0", "МодульОбъекта", НСтр("ru='Модуль объекта'"), "МОД", 1);
		
		ДобавитьЗаписьРасширенияОбъекта(Расширения, Наименование,
			".1", "Справка", НСтр("ru='Справка'"), "С", 3);
		
		ДобавитьЗаписьРасширенияОбъекта(Расширения, Наименование,
			".2", "МодульМенеджера", НСтр("ru='Модуль менеджера'"), "МОД", 2);
	КонецЦикла;
	#КонецОбласти 
	
	Возврат Новый ФиксированноеСоответствие(Расширения);
КонецФункции

Функция ПиктограммыПоТипуФайлов() Экспорт 
	Соответствие = Новый Соответствие; 
	Соответствие.Вставить("МОД", 63);
	Соответствие.Вставить("К", 20);
	Соответствие.Вставить("С", 64);
	Соответствие.Вставить("ПП", 66);
	Соответствие.Вставить("РО", -1);
	Соответствие.Вставить("КИ", 68);
	Соответствие.Вставить("М", 61);
	Соответствие.Вставить("Р", -1);
	Соответствие.Вставить("РС", -1);
	Соответствие.Вставить("П", 65);
	Соответствие.Вставить("КМ", 67);
	Соответствие.Вставить("АГР", 61);
	Соответствие.Вставить("ТХТ", 63);
	Соответствие.Вставить("МФ", 48);
	Соответствие.Вставить("*", -1);	
	
	Возврат Новый ФиксированноеСоответствие(Соответствие);
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Процедура ДобавитьЗаписьСтруктурыМетаданных(МетаСтруктура, знач Наименование, знач Владелец, знач Порядок,
	знач ВидМетаданных, знач ПутьКОбъекту, знач Синоним, знач ИндексКартинки, знач ИД_Перерасчеты = "", знач ИД_Формы = "",
	знач ИД_Команды = "", знач ИД_Макеты = "", знач Версия82 = Истина, знач Версия83 = Истина,
	знач ИД_Реквизиты = "", знач ИД_ТабличныеЧасти = "", знач ИД_РеквизитыТабЧасти = "",
	знач ИД_Значения = "", знач ИД_Измерения = "", знач ИД_Ресурсы = "")
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Наименование"				, Наименование);
	СтруктураЗаписи.Вставить("Владелец"					, Владелец);
	СтруктураЗаписи.Вставить("Порядок"					, Порядок);
	СтруктураЗаписи.Вставить("ВидМетаданных"			, ВидМетаданных);
	СтруктураЗаписи.Вставить("ПутьКОбъекту"				, ПутьКОбъекту);
	СтруктураЗаписи.Вставить("Синоним"					, Синоним);
	СтруктураЗаписи.Вставить("ИндексКартинки"			, ИндексКартинки);
	СтруктураЗаписи.Вставить("ИдентификаторПерерасчеты"	, ИД_Перерасчеты);
	СтруктураЗаписи.Вставить("ИдентификаторФормы"		, ИД_Формы);
	СтруктураЗаписи.Вставить("ИдентификаторКоманды"		, ИД_Команды);
	СтруктураЗаписи.Вставить("ИдентификаторМакеты"		, ИД_Макеты);
	СтруктураЗаписи.Вставить("ИдентификаторИзмерения"	, ИД_Измерения);
	СтруктураЗаписи.Вставить("ИдентификаторРесурсы"		, ИД_Ресурсы);
	СтруктураЗаписи.Вставить("ИдентификаторРеквизиты"	, ИД_Реквизиты);
	СтруктураЗаписи.Вставить("ИдентификаторТабЧасти"	, ИД_ТабличныеЧасти);
	СтруктураЗаписи.Вставить("ИдентификаторРеквизитыТЧ"	, ИД_РеквизитыТабЧасти);
	СтруктураЗаписи.Вставить("ИдентификаторЗначения"	, ИД_Значения);
	СтруктураЗаписи.Вставить("Версия82"					, Версия82);
	СтруктураЗаписи.Вставить("Версия83"					, Версия83);
	
	МетаСтруктура.Вставить(Наименование, Новый ФиксированнаяСтруктура(СтруктураЗаписи));
	
КонецПроцедуры

Процедура ДобавитьЗаписьРасширенияОбъекта(Расширения, знач Наименование, знач Расширение, знач Имя, знач Представление, знач Тип, знач Порядок = 0)
	ИндексКартинки = -1;
	Если ИндексКартинки = -1 Тогда
		Если Тип = "МОД" Тогда // модуль
			ИндексКартинки = 63;
		ИначеЕсли Тип = "К" Тогда // картинка
			ИндексКартинки = 20;
		ИначеЕсли Тип = "С" Тогда // справка
			ИндексКартинки = 64;
		ИначеЕсли Тип = "ПП" Тогда // поддержка подсистем
			ИндексКартинки = 66;
		ИначеЕсли Тип = "РО" Тогда // рабочая область
			//ИндексКартинки = -1;
		ИначеЕсли Тип = "КИ" Тогда // командный интерфейс
			ИндексКартинки = 68;
		ИначеЕсли Тип = "М" Тогда // макет
			ИндексКартинки = 61;
		ИначеЕсли Тип = "Р" Тогда // права
			//ИндексКартинки = -1;
		ИначеЕсли Тип = "РС" Тогда // расписание
			//ИндексКартинки = -1;
		ИначеЕсли Тип = "П" Тогда // предопределенные
			ИндексКартинки = 65;
		ИначеЕсли Тип = "КМ" Тогда // картка маршрута
			ИндексКартинки = 67;
		ИначеЕсли Тип = "АГР" Тогда // агрегаты
			ИндексКартинки = 61;
		ИначеЕсли Тип = "ТХТ" Тогда // текстовые данные
			ИндексКартинки = 63;
		ИначеЕсли Тип = "МФ" Тогда // модуль формы
			ИндексКартинки = 63;
		КонецЕсли;
	КонецЕсли;	
	
	СтруктураРасширения = Новый Структура;
	СтруктураРасширения.Вставить("Наименование"		, Наименование);
	СтруктураРасширения.Вставить("Расширение"		, Расширение);
	СтруктураРасширения.Вставить("Имя"				, Имя);
	СтруктураРасширения.Вставить("Представление"	, Представление);
	СтруктураРасширения.Вставить("Тип"				, Тип);
	СтруктураРасширения.Вставить("Порядок"			, Порядок);
	СтруктураРасширения.Вставить("ИндексКартинки"	, ИндексКартинки);
	
	РасширенияНаименования = Расширения.Получить(Наименование);
	Если РасширенияНаименования = Неопределено Тогда
		Соответствие = Новый Соответствие;
	Иначе 
		Соответствие = Новый Соответствие(РасширенияНаименования);
	КонецЕсли;
	
	Соответствие.Вставить(Расширение, Новый ФиксированнаяСтруктура(СтруктураРасширения));
	
	Расширения.Вставить(Наименование, Новый ФиксированноеСоответствие(Соответствие));
КонецПроцедуры

#КонецОбласти

#КонецЕсли 